 {
    "breakfast": [
        ["Greek Yogurt Parfait",
         ["Take a clean glass or bowl.",
          "First, spoon a layer of Greek yogurt into the bottom of the glass.",
          "Next, add a layer of granola on top of the yogurt.",
          "Then, arrange a layer of fresh berries [strawberries, blueberries, raspberries, etc.) over the granola.",
          "Repeat these layers as desired until the glass is full or you have reached your desired portion.",
          "Finally, if you like, sprinkle a few chopped nuts (almonds, walnuts, pecans, etc.) on the very top.",
          "Serve and enjoy immediately."],
         "normal", ["vegetarian", "high-protein"]],
        ["Avocado Toast",
         ["Take two slices of whole-grain bread.",
          "Place them in a toaster and toast until they are golden brown and slightly crispy.",
          "While the bread is toasting, take one ripe avocado.",
          "Cut the avocado in half, remove the pit, and scoop the flesh into a small bowl.",
          "Using a fork, mash the avocado until it reaches your desired consistency (chunky or smooth).",
          "Once the toast is ready, spread the mashed avocado evenly over both slices.",
          "Now, cook two large eggs to your liking (fried, scrambled, poached).",
          "Carefully place one cooked egg on top of the avocado on each slice of toast.",
          "Finally, sprinkle some 'everything bagel seasoning' generously over the eggs and avocado.",
          "Season with a pinch of salt and black pepper to taste. Serve immediately."],
         "normal", ["vegetarian", "high-protein"]],
        ["Banana Smoothie",
         ["Gather one ripe banana, one cup of milk (dairy or non-dairy like almond, soy, or oat), two tablespoons of peanut butter, and half a cup of ice cubes.",
          "If you are using protein powder, measure out one scoop.",
          "Place all the ingredients (banana, milk, peanut butter, protein powder if using, and ice) into a blender.",
          "Secure the lid tightly on the blender.",
          "Blend the ingredients on a medium to high speed until the smoothie is completely smooth and creamy. This should take about 30-60 seconds, depending on your blender.",
          "Once blended, pour the smoothie into a glass.",
          "Serve immediately and enjoy."],
         "underweight", ["vegetarian", "high-protein"]],
        ["Oatmeal with Honey",
         ["In a saucepan, pour one cup of milk or water.",
          "Bring the milk or water to a gentle boil over medium heat.",
          "Once boiling, add half a cup of rolled oats to the saucepan.",
          "Reduce the heat to low and let the oats simmer for about 5-7 minutes, stirring occasionally to prevent sticking.",
          "The oatmeal is ready when it has thickened to your desired consistency.",
          "Pour the cooked oatmeal into a bowl.",
          "Drizzle one tablespoon of honey over the top of the oatmeal.",
          "Sprinkle half a teaspoon of ground cinnamon over the honey and oatmeal.",
          "Finally, stir in one tablespoon of chia seeds.",
          "Let the oatmeal sit for a minute or two to allow the chia seeds to absorb some liquid and thicken further. Serve warm."],
         "underweight", ["vegetarian"]],
        ["Veggie Omelet",
         ["Gather three large eggs, a quarter cup of chopped bell peppers (any color), a quarter cup of chopped onion, a quarter cup of chopped spinach, and a quarter cup of shredded cheese (cheddar, mozzarella, etc.). Also have salt, pepper, and oil or butter ready.",
          "In a bowl, whisk the three eggs together thoroughly until the yolks and whites are fully combined.",
          "Season the whisked eggs with a pinch of salt and black pepper to your taste.",
          "Place a skillet (non-stick is best) over medium heat and add about one teaspoon of oil or half a teaspoon of butter to the pan. Let it heat up until the oil is shimmering or the butter is melted.",
          "Add the chopped bell peppers and onion to the skillet and sauté them for about 3-5 minutes, or until they start to soften.",
          "Add the chopped spinach to the skillet and cook for another 1-2 minutes, until it wilts.",
          "Pour the whisked egg mixture evenly into the skillet over the sautéed vegetables.",
          "As the edges of the omelet start to set (become opaque), gently push the cooked egg towards the center of the pan with a spatula, tilting the pan so that the uncooked liquid egg flows underneath to the hot surface. Repeat this process until most of the egg is set but the top is still slightly wet.",
          "Sprinkle the shredded cheese evenly over one half of the omelet.",
          "Carefully fold the other half of the omelet over the cheese.",
          "Cook for another minute or two until the cheese is melted and the eggs are fully set but still moist. Slide the omelet onto a plate and serve immediately."],
         "overweight", ["vegetarian", "low-carb"]],
        ["Boiled Eggs & Toast",
         ["Place two large eggs in a saucepan and cover them with enough cold water so that the water level is about one inch above the eggs.",
          "Bring the water to a rolling boil over high heat.",
          "Once boiling, remove the saucepan from the heat and cover it with a lid.",
          "Let the eggs sit in the hot water for 7-8 minutes for a firm yolk. If you prefer a softer yolk, reduce the time to 6 minutes.",
          "While the eggs are cooking, take two slices of whole grain bread and place them in a toaster. Toast until golden brown and slightly crispy.",
          "Once the eggs are done, immediately transfer them to a bowl of ice water to stop the cooking process and make them easier to peel.",
          "Peel the cooled hard-boiled eggs. You can slice them or eat them whole.",
          "Arrange the sliced or whole peeled eggs on the toasted whole grain bread.",
          "Season with a pinch of salt and black pepper to taste. Serve immediately."],
         "normal", ["high-protein"]],
        ["Nut Butter Toast",
         ["Take two slices of whole grain bread and place them in a toaster. Toast until golden brown and slightly crispy.",
          "Once the toast is ready, take two tablespoons of your favorite nut butter (almond, peanut, cashew, etc.).",
          "Spread the nut butter evenly over both slices of the toasted bread.",
          "Take half a ripe banana and slice it into thin rounds.",
          "Arrange the banana slices on top of the nut butter on both slices of toast.",
          "Finally, sprinkle one tablespoon of hemp seeds evenly over the banana slices. Serve immediately."],
         "underweight", ["vegetarian", "high-protein"]],
        ["Cottage Cheese & Fruit",
         ["Take one cup of low-fat cottage cheese and place it in a bowl.",
          "Wash and slice half a cup of your preferred fruit, such as peaches or berries (strawberries, blueberries, raspberries).",
          "Gently arrange the sliced fruit on top of the cottage cheese in the bowl. Serve immediately."],
         "normal", ["vegetarian", "high-protein"]],
        ["Scrambled Tofu",
         ["Gather one block (14 oz) of firm tofu, one cup of fresh spinach, half a teaspoon of turmeric powder, a quarter teaspoon of black pepper, one tablespoon of nutritional yeast (optional), salt, and some oil for cooking.",
          "Press the block of firm tofu to remove excess water. You can do this by wrapping it in paper towels and placing a heavy object on top for about 15-20 minutes.",
          "Once pressed, crumble the tofu into a skillet using your hands.",
          "Place the skillet over medium heat and add about one tablespoon of oil.",
          "Add the crumbled tofu to the hot skillet and cook for 5-7 minutes, stirring occasionally. This helps to dry out the tofu slightly.",
          "Stir in the turmeric powder and black pepper evenly into the tofu. Cook for another minute.",
          "Add the spinach to the skillet and cook until it wilts down, which should take about 1-2 minutes.",
          "If you are using nutritional yeast, stir it into the tofu mixture now. This adds a cheesy flavor.",
          "Season with salt to your taste. Stir everything together well. Serve hot."],
         "overweight", ["vegetarian", "high-protein", "low-carb"]],
        ["Protein Pancakes",
         ["In a bowl, combine one scoop of your preferred protein powder (vanilla or unflavored works well), two large eggs, a quarter cup of rolled oats, a quarter cup of milk (dairy or non-dairy), and half a teaspoon of baking powder.",
          "Mix all the ingredients together thoroughly with a whisk or fork until a smooth batter forms. There might be small lumps from the protein powder or oats, but try to minimize them.",
          "Heat a lightly oiled griddle or a non-stick pan over medium heat. You can test if the pan is hot enough by flicking a drop of water onto it; it should sizzle and evaporate quickly.",
          "Pour about a quarter cup of the batter onto the hot griddle for each pancake. You can make multiple pancakes at once depending on the size of your pan.",
          "Cook the pancakes for 2-3 minutes per side, or until the bottoms are golden brown and small bubbles appear on the surface. Flip them gently with a spatula and cook the other side until it is also golden brown and the pancake is cooked through.",
          "Serve the pancakes immediately, topped with half a cup of fresh or frozen mixed berries (strawberries, blueberries, raspberries) and, if desired, some sugar-free syrup. Enjoy!"]
         , "underweight", ["high-protein"]]
    ],
    "snacks": [
        ["Trail Mix",
         ["In a medium-sized bowl, combine half a cup of almonds, half a cup of walnuts, a quarter cup of pumpkin seeds, a quarter cup of sunflower seeds, half a cup of dried cranberries, and a quarter cup of dark chocolate chips.",
          "Stir all the ingredients together thoroughly until they are evenly distributed.",
          "Once mixed, you can store the trail mix in an airtight container at room temperature for several weeks. Enjoy a small handful as a snack."],
         "normal", ["vegetarian"]],
        ["Apple & Peanut Butter",
         ["Take one medium apple of your choice (Honeycrisp, Fuji, Gala, etc.).",
          "Wash the apple thoroughly under running water.",
          "Using a knife, slice the apple into wedges. You can remove the core if you prefer.",
          "Measure out two tablespoons of natural peanut butter into a small bowl or directly onto the apple slices.",
          "Serve the apple slices with the peanut butter for dipping. Enjoy!"]
         , "normal", ["vegetarian", "high-protein"]],
        ["Greek Yogurt & Berries",
         ["Take one cup of plain Greek yogurt and spoon it into a bowl.",
          "Wash half a cup of mixed berries (such as strawberries, blueberries, and raspberries) under running water.",
          "Gently place the fresh berries on top of the Greek yogurt in the bowl.",
          "Finally, sprinkle one tablespoon of chia seeds over the berries and yogurt. Serve immediately."],
         "normal", ["vegetarian", "high-protein"]],
        ["Rice Cakes & Hummus",
         ["Take two plain rice cakes.",
          "Measure out two tablespoons of your favorite hummus.",
          "Spread the hummus evenly over the surface of both rice cakes.",
          "Wash a quarter cup of cucumber. Slice it thinly into rounds or half-moons.",
          "Arrange the slices of cucumber on top of the hummus on the rice cakes. Serve immediately."],
         "normal", ["vegetarian"]],
        ["Protein Bar",
         ["Select one low-sugar protein bar of your choice. Ensure you check the nutrition label to confirm it is low in sugar and meets your protein goals.",
          "Unwrap the protein bar from its packaging.",
          "Consume the entire bar as a quick and convenient snack. It's best enjoyed at room temperature."],
         "underweight", ["high-protein", "low-carb"]],
        ["Boiled Eggs",
         ["Place two large eggs in a saucepan and cover them with enough cold water so that the water level is about one inch above the eggs.",
          "Bring the water to a rolling boil over high heat.",
          "Once boiling, remove the saucepan from the heat and cover it with a lid.",
          "Let the eggs sit in the hot water for 7-8 minutes for a firm yolk.",
          "After the time is up, immediately transfer the eggs to a bowl of ice water to stop the cooking process.",
          "Once cooled, peel the hard-boiled eggs. You can eat them whole or slice them.",
          "Sprinkle a pinch of sea salt and black pepper over the eggs to taste. Enjoy as a snack."],
         "normal", ["high-protein", "low-carb"]],
        ["Nut Mix",
         ["In a small bowl or directly in your hand, combine half a cup of almonds, half a cup of walnuts, and a quarter cup of sunflower seeds.",
          "Mix the nuts and seeds together.",
          "Enjoy a small handful of this mixture as a snack. Remember that nuts are calorie-dense, so consume in moderation, especially if you are aiming to manage your weight."],
         "overweight", ["vegetarian", "high-protein"]],
        ["Popcorn",
         ["Measure out three tablespoons of popcorn kernels.",
          "Use an air-popper according to the manufacturer's instructions to pop the kernels without any oil or butter.",
          "Alternatively, you can use a stovetop method in a pot with a tight-fitting lid, ensuring no oil or butter is added.",
          "Once the popcorn is popped, transfer it to a bowl.",
          "If desired, season lightly with a pinch of salt. Enjoy your air-popped popcorn as a low-calorie snack."],
         "overweight", ["vegetarian", "low-carb"]],
        ["Carrot Sticks & Hummus",
         ["Take one cup of pre-cut carrot sticks or wash and cut whole carrots into sticks.",
          "Measure out a quarter cup of creamy hummus into a small dipping container or bowl.",
          "Serve the carrot sticks alongside the hummus for dipping. Enjoy this healthy and satisfying snack."],
         "overweight", ["vegetarian", "low-carb"]],
        ["Fruit Cup",
         ["Gather half a cup of your favorite sliced fruits, such as strawberries, melon (cantaloupe, honeydew, watermelon), grapes, and kiwi.",
          "Wash all the fruits thoroughly under running water.",
          "Slice any larger fruits into bite-sized pieces.",
          "Combine all the sliced fruits in a cup or small bowl. Enjoy your colorful and refreshing fruit cup as a snack."],
         "normal", ["vegetarian"]]
    ],
    "lunch": [
        ["Grilled Chicken Wrap",
         ["Take one large whole wheat tortilla.",
          "Ensure you have 4 ounces of cooked grilled chicken breast, sliced into strips.",
          "Chop about 2 cups of romaine lettuce.",
          "Measure out 2 tablespoons of light Caesar dressing.",
          "Have a quarter cup of whole wheat croutons ready.",
          "Optional: Grate a small amount of Parmesan cheese.",
          "Warm the tortilla slightly in a dry pan or microwave for about 10-15 seconds to make it more pliable.",
          "In a bowl, toss the chopped romaine lettuce with the light Caesar dressing until the lettuce is lightly coated.",
          "Lay the warmed tortilla flat on a clean surface.",
          "Arrange the sliced grilled chicken and the dressed lettuce in the center of the tortilla.",
          "Sprinkle the whole wheat croutons over the chicken and lettuce.",
          "If desired, sprinkle a small amount of Parmesan cheese on top.",
          "Fold in the sides of the tortilla, then tightly roll it up from the bottom. Serve immediately."],
         "normal", ["high-protein"]],
        ["Turkey Sandwich",
         ["Gather two slices of whole grain bread.",
          "Have 4 ounces of sliced turkey breast ready.",
          "Slice a quarter of a ripe avocado.",
          "Wash and have a quarter cup of spinach leaves ready.",
          "Measure out one tablespoon of Dijon mustard.",
          "Spread the Dijon mustard evenly on one slice of the whole grain bread.",
          "Layer the spinach leaves on top of the mustard.",
          "Arrange the sliced turkey breast over the spinach.",
          "Place the sliced avocado on top of the turkey.",
          "Carefully place the other slice of whole grain bread on top to complete the sandwich. You can slice it in half before serving if you prefer."],
         "normal", ["high-protein"]],
        ["Pasta Salad",
         ["Cook 1 cup of whole wheat pasta according to the package directions until it is al dente.",
          "While the pasta is cooking, rinse and drain half a cup of chickpeas.",
          "Chop half a cup of cucumber into small pieces.",
          "Chop half a cup of bell peppers (any color) into small pieces.",
          "Halve a quarter cup of Kalamata olives.",
          "Once the pasta is cooked, drain it well and rinse with cold water to stop the cooking process. Let it cool.",
          "In a large bowl, combine the cooled whole wheat pasta, rinsed chickpeas, chopped cucumber, chopped bell peppers, and halved Kalamata olives.",
          "Crumble 2 tablespoons of feta cheese over the mixture.",
          "Pour 2 tablespoons of light vinaigrette dressing over the salad.",
          "Toss all the ingredients gently until everything is well combined and coated with the dressing. Serve chilled or at room temperature."],
         "normal", ["vegetarian", "high-protein"]],
        ["Lentil Soup",
         ["Rinse 1 cup of brown or green lentils thoroughly under cold running water.",
          "In a large pot, pour 4 cups of vegetable broth.",
          "Add the rinsed lentils, 1 cup of chopped carrots, 1 cup of chopped celery, 1 cup of chopped onion, 2 cloves of minced garlic,1 teaspoon of dried thyme, and 1 bay leaf to the pot.",
          "Season with a pinch of salt and black pepper to your taste. Remember you can always add more seasoning later.",
          "Bring the soup to a boil over medium-high heat, then reduce the heat to low, cover the pot, and let it simmer for about 25-30 minutes, or until the lentils and vegetables are tender.",
          "Remove the bay leaf before serving.",
          "Taste the soup and adjust the seasoning (salt, pepper, thyme) if needed. Serve hot."],
         "overweight", ["vegetarian", "high-protein"]],
        ["Quinoa Bowl",
         ["Cook 1 cup of quinoa according to the package instructions.",
          "While the quinoa is cooking, prepare your vegetables. You will need about 1 cup of roasted vegetables such as broccoli florets, bell peppers (chopped), and zucchini (diced). If you don't have pre-roasted vegetables, you can toss them with a little olive oil, salt, and pepper and roast them in the oven at 400°F (200°C) for about 15-20 minutes, or until tender.",
          "Rinse and drain half a cup of cooked black beans.",
          "Dice a quarter of a ripe avocado.",
          "Have a quarter cup of corn ready (fresh, frozen and thawed, or canned and drained).",
          "Once the quinoa is cooked, fluff it with a fork.",
          "In a bowl, place the cooked quinoa as the base.",
          "Arrange the roasted vegetables, black beans, diced avocado, and corn over the quinoa.",
          "Optional: You can add a drizzle of your favorite light dressing or a squeeze of lime juice for extra flavor. Serve warm or at room temperature."],
         "overweight", ["vegetarian", "high-protein"]],
        ["Tuna Salad",
         ["Drain one can (5 oz) of tuna packed in water very well.",
          "In a medium-sized bowl, flake the drained tuna with a fork.",
          "Add half a cup of plain Greek yogurt to the bowl with the tuna.",
          "Finely chop a quarter cup of celery.",
          "Finely chop a quarter cup of red onion.",
          "Add the chopped celery and red onion to the tuna and Greek yogurt.",
          "Season with a pinch of salt and black pepper to your taste.",
          "Stir all the ingredients together thoroughly until well combined.",
          "You can serve the tuna salad on its own, over lettuce greens, in a whole wheat pita pocket, or as a filling for a whole grain sandwich. Store any leftovers in the refrigerator."],
         "normal", ["high-protein"]],
        ["Peanut Butter Sandwich",
         ["Take two slices of whole grain bread.",
          "Measure out two tablespoons of your favorite peanut butter.",
          "Spread the peanut butter evenly on one slice of the whole grain bread.",
          "You can enjoy it as is, or for extra flavor and nutrition, you can add slices of half a banana or a drizzle of honey on top of the peanut butter.",
          "Place the other slice of whole grain bread on top to make a sandwich. You can slice it in half before serving if you prefer."],
         "underweight", ["vegetarian", "high-protein"]],
        ["Chicken Caesar Salad",
         ["Ensure you have 4 ounces of cooked grilled chicken breast, sliced or shredded.",
          "Wash and chop about 4 cups of romaine lettuce.",
          "Measure out 2 tablespoons of light Caesar dressing.",
          "Have a quarter cup of whole wheat croutons ready.",
          "Optional: Grate a small amount of Parmesan cheese.",
          "In a large bowl, combine the chopped romaine lettuce and the sliced or shredded grilled chicken.",
          "Pour the light Caesar dressing over the lettuce and chicken.",
          "Toss gently until the lettuce and chicken are evenly coated with the dressing.",
          "Transfer the salad to a plate or bowl.",
          "Sprinkle the whole wheat croutons over the top of the salad.",
          "If desired, sprinkle a small amount of Parmesan cheese on top. Serve immediately."],
         "overweight", ["high-protein", "low-carb"]],
        ["Zucchini Noodles",
         ["Wash one medium-sized zucchini thoroughly.",
          "Using a spiralizer, turn the zucchini into noodles. If you don't have a spiralizer, you can use a vegetable peeler to create wide ribbons.",
          "Place a skillet over medium heat and add a teaspoon of olive oil or cooking spray.",
          "Add 2 cloves of minced garlic to the skillet and sauté for about 30 seconds until fragrant, being careful not to burn it.",
          "Add half a cup of chopped fresh tomatoes to the skillet and cook for a few minutes until they start to soften.",
          "Add the zucchini noodles to the skillet and sauté for 2-3 minutes until they are slightly tender but still have a bit of a bite (al dente). Avoid overcooking them, as they can become watery.",
          "Season with a pinch of salt and black pepper to your taste.",
          "You can also add other herbs like basil or oregano if you like. Serve immediately."],
         "normal", ["vegetarian", "low-carb"]],
        ["Veggie Burrito",
         ["Warm one large whole wheat tortilla in a dry pan or microwave for about 10-15 seconds to make it more pliable.",
          "Have ready half a cup of cooked rice (brown or white), half a cup of cooked black beans (rinsed and drained), and half a cup of your favorite chopped vegetables (such as bell peppers, onions, corn, sautéed spinach).",
          "You can also have a quarter of a ripe avocado, sliced or mashed, and some salsa ready.",
          "Lay the warmed tortilla flat on a clean surface.",
          "In the center of the tortilla, layer the cooked rice, black beans, and chopped vegetables.",
          "Add the sliced or mashed avocado and a spoonful of salsa on top of the vegetables.",
          "Fold in the sides of the tortilla, then tightly roll it up from the bottom. Serve immediately."],
         "underweight", ["vegetarian"]]
    ],
    "dinner": [
        ["Grilled Salmon",
         ["Take one salmon fillet (about 4-6 ounces).",
          "Rinse the salmon fillet under cold water and pat it dry with paper towels.",
          "Season the salmon generously with salt, black pepper, and any other herbs or spices you enjoy (such as dill, lemon pepper, or paprika). You can also squeeze a bit of fresh lemon juice over it.",
          "Preheat your grill to medium heat.",
          "Lightly oil the grill grates to prevent sticking.",
          "Place the seasoned salmon fillet skin-side down (if it has skin) on the preheated grill.",
          "Grill for about 4-5 minutes per side, or until the salmon is cooked through and flakes easily with a fork. The internal temperature should reach 145°F (63°C).",
          "While the salmon is grilling, prepare your vegetables. You can grill them alongside the salmon or steam or roast them separately.",
          "Serve the grilled salmon fillet with your cooked vegetables on the side. A squeeze of fresh lemon juice over the salmon before serving can enhance the flavor."],
         "normal", ["high-protein"]],
        ["Chicken Stir Fry",
         ["Cut about 4-6 ounces of boneless, skinless chicken breast into bite-sized pieces.",
          "Prepare about 2 cups of your favorite mixed vegetables, such as broccoli florets, sliced bell peppers (various colors), sliced carrots, snow peas, and sliced onions.",
          "Mince 2 cloves of garlic and grate about 1 teaspoon of fresh ginger.",
          "In a wok or large skillet, heat about 1 tablespoon of cooking oil (such as olive oil, sesame oil, or vegetable oil) over medium-high heat.",
          "Add the diced chicken to the hot wok or skillet and stir-fry for about 5-7 minutes, or until it is cooked through and lightly browned.",
          "Remove the cooked chicken from the wok and set it aside.",
          "Add the minced garlic and grated ginger to the wok and stir-fry for about 30 seconds until fragrant.",
          "Add the prepared mixed vegetables to the wok and stir-fry for about 5-7 minutes, or until they are tender-crisp.",
          "Return the cooked chicken to the wok with the vegetables.",
          "Pour in about 2-3 tablespoons of your favorite stir-fry sauce (low-sodium options are preferable).",
          "Stir everything together to coat the chicken and vegetables evenly with the sauce. Cook for another 1-2 minutes until heated through.",
          "Serve the chicken stir-fry hot. You can serve it over a bed of brown rice or quinoa if desired."],
         "normal", ["high-protein"]],
        ["Beef & Rice",
         ["Take about 4-6 ounces of lean ground beef.",
          "Cook 1 cup of brown rice according to the package instructions.",
          "Dice half an onion and mince 1 clove of garlic.",
          "In a skillet over medium heat, add the ground beef and cook, breaking it up with a spoon, until it is browned.",
          "Drain any excess fat from the skillet.",
          "Add the diced onion and minced garlic to the skillet with the browned beef and cook for another 3-5 minutes until the onion is softened.",
          "Season the beef mixture with salt, black pepper, and any other spices you like (such as cumin or paprika).",
          "Once the brown rice is cooked, fluff it with a fork.",
          "Serve the lean beef mixture over a portion of the cooked brown rice. You can add some steamed vegetables on the side for a more balanced meal."],
         "underweight", ["high-protein"]],
        ["Stuffed Peppers",
         ["Preheat your oven to 375°F (190°C).",
          "Take 2 medium-sized bell peppers (any color). Cut them in half lengthwise and remove the seeds and membranes.",
          "Cook half a cup of brown rice according to the package instructions.",
          "Sauté half a diced onion and 1 minced garlic clove in a skillet with a little olive oil until softened.",
          "Add about 4 ounces of lean ground turkey or beef to the skillet and cook until browned, breaking it up with a spoon. Drain any excess fat.",
          "Stir in the cooked brown rice, half a cup of your favorite chopped vegetables (such as diced zucchini or corn), and a quarter cup of tomato sauce into the meat mixture. Season with salt, pepper, and any desired herbs (like oregano or basil).",
          "Stuff each bell pepper half with the meat and rice mixture.",
          "Place the stuffed peppers in a baking dish and pour the remaining tomato sauce (if any) over the top.",
          "Bake in the preheated oven for about 30-40 minutes, or until the peppers are tender and the filling is heated through. You can sprinkle a little shredded cheese on top during the last few minutes of baking if desired."],
         "normal", ["high-protein"]],
        ["Vegetable Curry",
         ["Heat 1 tablespoon of coconut oil in a pot or large skillet over medium heat.",
          "Add 1 diced onion and cook until softened, about 5 minutes.",
          "Add 2 cloves of minced garlic and 1 tablespoon of grated fresh ginger and cook for another minute until fragrant.",
          "Stir in 1-2 tablespoons of your favorite curry paste (red, green, or yellow, depending on your preference). Cook for about 30 seconds, stirring constantly.",
          "Add 1 can (13.5 oz) of full-fat coconut milk and half a cup of vegetable broth to the pot. Bring to a simmer.",
          "Add about 2 cups of your favorite chopped vegetables, such as cauliflower florets, broccoli florets, diced carrots, diced sweet potatoes, and spinach. You can also add chickpeas or lentils for extra protein.",
          "Season with salt to taste. Cover the pot and let the curry simmer for about 15-20 minutes, or until the vegetables are tender.",
          "Stir in a handful of fresh spinach during the last few minutes of cooking until it wilts.",
          "Serve the vegetable curry hot over a bed of brown rice or quinoa. Garnish with fresh cilantro if desired."],
         "normal", ["vegetarian"]],
        ["Baked Tofu & Broccoli",
         ["Preheat your oven to 400°F (200°C).",
          "Press one block (14 oz) of firm or extra-firm tofu to remove excess water. You can do this by wrapping it in paper towels and placing a heavy object on top for about 20-30 minutes.",
          "Once pressed, cut the tofu into cubes (about 1-inch).",
          "Toss the tofu cubes in a bowl with 1 tablespoon of soy sauce (low-sodium preferred), 1 teaspoon of sesame oil, and a pinch of garlic powder. Marinate for at least 10 minutes.",
          "Spread about 2 cups of broccoli florets on a baking sheet.",
          "Toss the broccoli with a little olive oil, salt, and pepper.",
          "Arrange the marinated tofu cubes on the same baking sheet with the broccoli.",
          "Bake in the preheated oven for about 20-25 minutes, flipping the tofu and stirring the broccoli halfway through, until the tofu is golden brown and slightly crispy and the broccoli is tender-crisp.",
          "Serve the baked tofu and broccoli hot. You can drizzle a little extra soy sauce or a sprinkle of sesame seeds before serving if desired."],
         "overweight", ["vegetarian", "high-protein", "low-carb"]],
        ["Mac & Cheese",
         ["Cook 1 cup of your preferred pasta (such as elbow macaroni or shells) according to the package directions until al dente.",
          "While the pasta is cooking, prepare the cheese sauce. In a saucepan over low heat, melt 2 tablespoons of butter.",
          "Whisk in 2 tablespoons of all-purpose flour and cook for about 1 minute to form a roux.",
          "Gradually whisk in 1 cup of milk (dairy or non-dairy) until the sauce is smooth.",
          "Continue to whisk over medium heat until the sauce thickens slightly.",
          "Remove the saucepan from the heat and stir in 1 cup of shredded cheese (cheddar, Monterey Jack, or a blend). Stir until the cheese is completely melted and the sauce is smooth and creamy.",
          "Season the cheese sauce with a pinch of salt and black pepper to your taste. You can also add a pinch of nutmeg or mustard powder for extra flavor if desired.",
          "Once the pasta is cooked, drain it well and add it to the saucepan with the cheese sauce.",
          "Stir the pasta and cheese sauce together until the pasta is evenly coated.",
          "Serve the mac & cheese hot. You can sprinkle some breadcrumbs on top and bake it in the oven for a few minutes for a crispy topping if you like."],
         "underweight", ["vegetarian"]],
        ["Grilled Shrimp Salad",
         ["Take about 4-6 ounces of raw shrimp, peeled and deveined.",
          "Toss the shrimp in a bowl with a little olive oil, salt, pepper, and your favorite seasonings (such as garlic powder, paprika, or chili powder).",
          "Preheat your grill or a grill pan to medium heat.",
          "Grill the shrimp for about 2-3 minutes per side, or until they are pink and cooked through.",
          "Prepare a salad base with about 4 cups of mixed greens (lettuce, spinach, etc.).",
          "Add your favorite salad vegetables, such as sliced cucumber, cherry tomatoes (halved), and sliced bell peppers, to the greens.",
          "Arrange the grilled shrimp over the top of the salad.",
          "Prepare a light vinaigrette dressing by whisking together olive oil, vinegar (balsamic or red wine), a little Dijon mustard, salt, and pepper to taste.",
          "Drizzle the light vinaigrette dressing over the salad. Serve immediately."],
         "normal", ["high-protein", "low-carb"]],
        ["Turkey Meatballs",
         ["Preheat your oven to 375°F (190°C).",
          "In a bowl, combine about 1 pound of lean ground turkey, half a cup of breadcrumbs (whole wheat preferred), a quarter cup of finely chopped onion, 1 minced garlic clove, 1 large egg, a quarter cup of chopped fresh parsley, and a pinch of salt and black pepper.",
          "Mix all the ingredients together gently with your hands until just combined. Be careful not to overmix.",
          "Shape the mixture into small meatballs (about 1-inch in diameter).",
          "Place the meatballs on a baking sheet lined with parchment paper.",
          "Bake in the preheated oven for about 20-25 minutes, or until the meatballs are cooked through and lightly browned.",
          "While the meatballs are baking, prepare your spaghetti squash. Cut one medium spaghetti squash in half lengthwise and scoop out the seeds.",
          "Place the spaghetti squash halves cut-side down on a baking sheet and bake for about 40-50 minutes, or until the flesh is tender and can be easily shredded with a fork.",
          "Once the spaghetti squash is cooked, shred the flesh into noodle-like strands.",
          "Serve the baked turkey meatballs over a bed of spaghetti squash noodles. You can top with a little low-sugar marinara sauce if desired."],
         "overweight", ["high-protein", "low-carb"]],
        ["Steak & Sweet Potatoes",
         ["Preheat your oven to 400°F (200°C).",
          "Take one lean steak (about 4-6 ounces), such as sirloin or flank steak.",
          "Season the steak generously with salt, black pepper, and any other seasonings you like (such as garlic powder, onion powder, or paprika).",
          "Wash one medium sweet potato and dice it into bite-sized pieces.",
          "Toss the diced sweet potato in a bowl with a little olive oil, salt, and pepper.",
          "Spread the seasoned sweet potato on a baking sheet and roast in the preheated oven for about 20-25 minutes, or until tender and slightly caramelized.",
          "While the sweet potato is roasting, heat a skillet (cast iron is ideal) over medium-high heat with a little olive oil.",
          "Once the skillet is hot, sear the steak for about 3-4 minutes per side, and plate!"],
          "underweight", ["high-protein", "low-carb"]]
         ]
}
